app/controllers/books_controller.rb

  def index
     if !user_signed_in?
      redirect_to new_user_session_path
    end
      @books = Book.where(user_id: current_user.id)
---
SELECT "books".* FROM "books" WHERE "books"."user_id" = $1  [["user_id", 1]]

  def create
    if !user_signed_in?
      redirect_to new_user_session_path
    end
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    respond_to do |format|
      if @book.save
        format.html { redirect_to @book, notice: 'Buch wurde erfolgreich erstellt.' }
        format.json { render :show, status: :created, location: @book }
        @contacts = Contact.where(user_id: current_user.id)
---
INSERT INTO "books" ("isbn", "pages", "title", "public_date", "description", "created_at", "updated_at", "autoren", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
SELECT "contacts".* FROM "contacts" WHERE "contacts"."user_id" = $1  [["user_id", 1]]

  def update
    if !user_signed_in?
      redirect_to new_user_session_path
    end
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE "books" SET "autoren" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["autoren", "Hello World Autor"], ["updated_at", "2017-09-26 14:38:05.249818"], ["id", 1]]

  def destroy
    if !user_signed_in?
      redirect_to new_user_session_path
    end
    @book.destroy
---
DELETE FROM "books" WHERE "books"."id" = $1  [["id", 2]]