app/controllers/contacts_controller.rb

  def index
    if !user_signed_in?
      redirect_to new_user_session_path
    end
    @contacts = Contact.where(user_id: current_user.id)
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."user_id" = $1  [["user_id", 1]]

  def create
    if !user_signed_in?
      redirect_to new_user_session_path
    end
    @contact = Contact.new(contact_params)
    @contact.user_id = current_user.id

    respond_to do |format|
      if @contact.save
---
INSERT INTO "contacts" ("vorname", "nachname", "email", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["vorname", "Cedric"], ["nachname", "Oswald"], ["email", "cosw@gmail.com"], ["user_id", 1], ["created_at", "2017-09-26 20:21:05.172844"], ["updated_at", "2017-09-26 20:21:05.172844"]]